Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.GridColor
Color of grid lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings)
Constructs a new copy of the input AnalysisDisplayDeformedShapeSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013